embvm/stm32l4/src/drivers/stm32_i2c_master.cpp
#include "stm32_i2c_master.hpp"
#include <array>
#include <cassert>
#include <driver/gpio.hpp> // for embvm::gpio::port
#include <nvic.hpp>
#include <processor_includes.hpp>
#include <stm32_rcc.hpp>
#include <stm32l4xx_ll_dma.h> // For configuration of DMA channel; TODO: break dependency
#include <stm32l4xx_ll_gpio.h> // TODO: break dependency
#include <stm32l4xx_ll_i2c.h>

// TODO: how can I move internal items like this, as well as other processor-dep. settings,
// into the processor layer? This would help us keep drivers common.
// One thought is taking the config-table approach that Beningo uses in his drivers.
// Then we can make defs public, and keep the impl. private, accessing them through pointers.
// TODO: Set a timer to trigger a timeout callback (using timer manager?)

/* Useful Developer Notes
 *
 * Working in start/stop mode:
 *   In order to start a transfer in Master mode, I2C Control Register 2 must be written with the
 *   Start condition request, the slave address, the transfer direction, the number of bytes to be
 *   transferred, and the End of Transfer mode. End of Transfer mode is configured by the AUTOEND
 *   bit. If it is set, the Stop condition is automatically sent after the programmed number of
 *   bytes is transferred.
 *
 *   If the AUTOEND bit is not set, the end of transfer is managed by software. After the programmed
 *   number of bytes is transferred, the Transfer Complete (TC) flag is set and an interrupt is
 *   generated, if enabled. Then a Repeated Start or a Stop condition can be requested by
 *   software.
 *
 *   The data transfer can be managed by interrupts or by the DMA.
 *
 *   For payloads > 255: the Reload bit must be set in I2C_CR2
 *   No reload == NBYTES data transferred, followed by STOP or RESTART
 *   Reload == NBYTES is reloaded after NBYTES of data is transfered; data transfer will resume
 *     Interrupt is generated if enabled, and TCR flag is set.
 */

#pragma mark - Definitions -

constexpr size_t MAX_I2C_TRANSFER_SIZE_BYTES = 255;
using STM32I2C_cb_t = stdext::inplace_function<void(embvm::i2c::status)>;

#pragma mark - Types and Declarations -

struct STM32_I2C_Pins_t
{
	embvm::gpio::port sda_port;
	uint8_t sda_pin;
	uint8_t sda_alt_func;
	embvm::gpio::port scl_port;
	uint8_t scl_pin;
	// Because processors and pin selections require different alternate setting values, we need
	// to store the items in the table for our processor
	uint8_t scl_alt_func;
} __attribute__((packed));

// TODO: actually, I just need to pull this out of this class and expand the GPIO class to
// accomodate alternate functions
// TODO: how can we make this more configurable for users, since the pins will
// really change based on the board design? E.g., you can select different AF settings
// for diff pins. I2C3 SDA might be PB4/PC1 with AF4, or it might be PC9 with AF6.
// Maybe this really needs to be done with the GPIO class, so the pins are configured properly.
// clang-format off
constexpr std::array<STM32_I2C_Pins_t, 4> i2c_pins =
{
  // TODO: I2C1 GPIO
  STM32_I2C_Pins_t{
    .sda_port = embvm::gpio::port::A,
    .sda_pin= 0,
    .sda_alt_func = LL_GPIO_AF_0,
    .scl_port = embvm::gpio::port::A,
    .scl_pin = 0,
    .scl_alt_func = LL_GPIO_AF_0

  },
  // I2C2 GPIO
  STM32_I2C_Pins_t{
    .sda_port = embvm::gpio::port::F,
    .sda_pin= 0,
    .sda_alt_func = LL_GPIO_AF_4,
    .scl_port = embvm::gpio::port::F,
    .scl_pin = 1,
    .scl_alt_func = LL_GPIO_AF_4
  },
  // TODO: I2C3 GPIO
  STM32_I2C_Pins_t{
    .sda_port = embvm::gpio::port::A,
    .sda_pin= 0,
    .sda_alt_func = LL_GPIO_AF_0,
    .scl_port = embvm::gpio::port::A,
    .scl_pin = 0,
    .scl_alt_func = LL_GPIO_AF_0,
  },
  // TODO: I2C4 GPIO
  STM32_I2C_Pins_t{
    .sda_port = embvm::gpio::port::A,
    .sda_pin= 0,
    .sda_alt_func = LL_GPIO_AF_0,
    .scl_port = embvm::gpio::port::A,
    .scl_pin = 0,
    .scl_alt_func = LL_GPIO_AF_0
  }
};
// clang-format on

enum class end_transfer_option : uint8_t {
	IGNORED = 0,
	DO_NOTHING,
	AUTOEND,
	START_RX,
};

constexpr unsigned I2C_COUNT = STM32I2CMaster::device::NUM_I2C_DEVICES;

constexpr std::array<I2C_TypeDef* const, I2C_COUNT> i2c_instance = {I2C1, I2C2, I2C3, I2C4};

constexpr std::array<uint32_t, I2C_COUNT> dma_tx_routing = {LL_DMAMUX_REQ_I2C1_TX, LL_DMAMUX_REQ_I2C2_TX,
													LL_DMAMUX_REQ_I2C3_TX, LL_DMAMUX_REQ_I2C4_TX};

constexpr std::array<uint32_t, I2C_COUNT> dma_rx_routing = {LL_DMAMUX_REQ_I2C1_RX, LL_DMAMUX_REQ_I2C2_RX,
													LL_DMAMUX_REQ_I2C3_RX, LL_DMAMUX_REQ_I2C4_RX};

static std::array<STM32I2C_cb_t, I2C_COUNT> i2c_callbacks = {nullptr};

constexpr std::array<uint8_t, I2C_COUNT> event_irq_num = {I2C1_EV_IRQn, I2C2_EV_IRQn, I2C3_EV_IRQn,
												  I2C4_EV_IRQn};

constexpr std::array<uint8_t, I2C_COUNT> error_irq_num = {I2C1_ER_IRQn, I2C2_ER_IRQn, I2C3_ER_IRQn,
												  I2C4_ER_IRQn};

static std::array<size_t, I2C_COUNT> transfer_reload_size = {0};
static std::array<end_transfer_option, I2C_COUNT> end_of_transfer_action = {false};

#pragma mark - Helpers -

static inline void enableDMATx(STM32DMA& ch_, I2C_TypeDef* inst, const uint8_t* buffer, size_t size)
{
	ch_.setAddresses(
		const_cast<uint8_t*>(
			buffer), // This is frowned upon, but the underlying STM32 code doesn't take const.
		reinterpret_cast<uint32_t*>(LL_I2C_DMA_GetRegAddr(inst, LL_I2C_DMA_REG_DATA_TRANSMIT)),
		size);
	ch_.enable();
}

static inline void enableDMARx(STM32DMA& ch_, I2C_TypeDef* inst, uint8_t* const buffer, size_t size)
{
	ch_.setAddresses(
		reinterpret_cast<uint32_t*>(LL_I2C_DMA_GetRegAddr(inst, LL_I2C_DMA_REG_DATA_RECEIVE)),
		buffer, size);
	ch_.enable();
}

/** Check and adjust transfer size to handle transfers > 255 bytes
 *
 * @precondition op_buffer_size > 0
 * @param [in] op_buffer_size The size of the TX or RX buffer as specified in the op request
 * @param [inout] bytes_remaining The value of the bytes remaining in additional transfers.
 *	This parameter will be non-zero when
 * @param [in] desired_end_mode The end mode that you want to set if the transfer size is within
 *	limits for a single transfer.
 * @returns A std::tuple containing:
 *	1. the active transfer size in bytes (size_t)
 *	2. the adjusted end mode (uint32_t)
 *		If the transfer size is > 255 bytes, then the end mode will be set to LL_I2C_MODE_RELOAD,
 *		otherwise it will be set to desired_end_mode.
 *
 * @note This function needs to be modified to support SMBus, beacuse the SMBus modes are not
 * considered here, especially for the autoend value.
 */
static std::tuple<size_t, uint32_t> check_and_adjust_transfer_size(const STM32I2CMaster::device dev,
																   const uint32_t& op_buffer_size,
																   uint32_t desired_end_mode)
{
	uint32_t bytes_for_immediate_transfer;
	uint32_t actual_end_mode;

	if(op_buffer_size > MAX_I2C_TRANSFER_SIZE_BYTES)
	{
		transfer_reload_size[dev] = op_buffer_size - MAX_I2C_TRANSFER_SIZE_BYTES;
		bytes_for_immediate_transfer = MAX_I2C_TRANSFER_SIZE_BYTES;
		actual_end_mode = LL_I2C_MODE_RELOAD;
		end_of_transfer_action[dev] = (desired_end_mode == LL_I2C_MODE_AUTOEND) ? end_transfer_option::AUTOEND : end_transfer_option::DO_NOTHING;
	}
	else
	{
		bytes_for_immediate_transfer = op_buffer_size;
		transfer_reload_size[dev] = 0;
		actual_end_mode = desired_end_mode;
		end_of_transfer_action[dev] = end_transfer_option::IGNORED;
	}

	return {bytes_for_immediate_transfer, actual_end_mode};
}

/**
 *
 * @param [in] dev The device ID, which is used for accessing the arrays
 * @param [in] inst The device instance, which saves us a dereference + assert since
 * 	we've already checked this in the caller's context.
 *
 * @returns a flag indicating whether the transfer is complete (true) or not (false)
 */
[[nodiscard]] static bool transfer_reload_or_end(const STM32I2CMaster::device dev, I2C_TypeDef* const inst)
{
	bool complete = false;

	auto size = transfer_reload_size[dev];
	if(size > MAX_I2C_TRANSFER_SIZE_BYTES)
	{
		transfer_reload_size[dev] = size - MAX_I2C_TRANSFER_SIZE_BYTES;
		size = MAX_I2C_TRANSFER_SIZE_BYTES;
		LL_I2C_SetTransferSize(inst, size);
	}
	else if(size == 0)
	{
		complete = true;
		LL_I2C_DisableReloadMode(inst);

