embvm/stm32l4/src/drivers/stm32_i2c_master.cpp
		// Check auto-end logic
		if(end_of_transfer_action[dev] == end_transfer_option::AUTOEND)
		{
			LL_I2C_GenerateStopCondition(inst);
		}
	}
	else
	{
		transfer_reload_size[dev] = 0;
		LL_I2C_SetTransferSize(inst, size);
	}

	return complete;
}

#pragma mark - Interrupt Handlers -

extern "C" void I2C1_ER_IRQHandler(void);
extern "C" void I2C1_EV_IRQHandler(void);
extern "C" void I2C2_ER_IRQHandler(void);
extern "C" void I2C2_EV_IRQHandler(void);
extern "C" void I2C3_ER_IRQHandler(void);
extern "C" void I2C3_EV_IRQHandler(void);
extern "C" void I2C4_ER_IRQHandler(void);
extern "C" void I2C4_EV_IRQHandler(void);

static void i2c_error_handler(STM32I2CMaster::device dev)
{
	(void)dev;
	assert(0); // TODO: Handle error
}

static void i2c_event_handler(STM32I2CMaster::device dev)
{
	auto inst = i2c_instance[dev];
	assert(inst); // invalid instance
	auto cb = i2c_callbacks[dev];
	bool transfer_complete = false;
	auto status = embvm::i2c::status::ok;

	if(LL_I2C_IsActiveFlag_TCR(inst))
	{
		transfer_complete = transfer_reload_or_end(dev, inst);
	}
	else if(LL_I2C_IsActiveFlag_TC(inst))
	{
		// Happens hwen RELOAD=0, AUTOEND=0, and NBYTES have been transferred
		transfer_complete = true;
	}
	else if(LL_I2C_IsActiveFlag_STOP(inst))
	{
		// True when AUTOEND is set.
		LL_I2C_ClearFlag_STOP(inst);
		transfer_complete = true;
	}
	else if(LL_I2C_IsActiveFlag_NACK(inst))
	{
		LL_I2C_ClearFlag_NACK(inst);
		transfer_complete = true;
		// TODO: how to differentiate between ADDR nack and data nack here?
		// Probably need to use LL_I2C_ICR_ADDRCF - if not set, then we have addr nack?
		status = embvm::i2c::status::dataNACK;
	}

	// TODO: dispatch this to an IRQ bottom-half handler
	if(transfer_complete && cb)
	{
		cb(status);
	}
}

void I2C1_ER_IRQHandler()
{
	i2c_error_handler(STM32I2CMaster::device::i2c1);
}

void I2C1_EV_IRQHandler()
{
	i2c_event_handler(STM32I2CMaster::device::i2c1);
}

void I2C2_ER_IRQHandler()
{
	i2c_error_handler(STM32I2CMaster::device::i2c2);
}

void I2C2_EV_IRQHandler()
{
	i2c_event_handler(STM32I2CMaster::device::i2c2);
}

void I2C3_ER_IRQHandler()
{
	i2c_error_handler(STM32I2CMaster::device::i2c3);
}

void I2C3_EV_IRQHandler()
{
	i2c_event_handler(STM32I2CMaster::device::i2c3);
}

void I2C4_ER_IRQHandler()
{
	i2c_error_handler(STM32I2CMaster::device::i2c4);
}

void I2C4_EV_IRQHandler()
{
	i2c_event_handler(STM32I2CMaster::device::i2c4);
}

#pragma mark - Driver APIs -

// TODO: need to control fast vs slow mode
// currently configured for fast mode
// This value is seriously hard-coded??? I2C_TIMING
#if 0

  /* Configure the SDA setup, hold time and the SCL high, low period */
  /* Timing register value is computed with the STM32CubeMX Tool,
    * Fast Mode @400kHz with I2CCLK = 80 MHz,
    * rise time = 100ns, fall time = 10ns
    * Timing Value = (uint32_t)0x00F02B86
    */
  timing = __LL_I2C_CONVERT_TIMINGS(0x0, 0xF, 0x0, 0x2B, 0x86);
  LL_I2C_SetTiming(I2C1, timing);



/* Timing register value is computed with the STM32CubeMX Tool,
  * Fast Mode @400kHz with I2CCLK = 80 MHz,
  * rise time = 100ns, fall time = 10ns
  * Timing Value = (uint32_t)0x00F02B86
  */
#define I2C_TIMING 0x00F02B86

Maybe we provide a way to make this configurable, ALA table, allowing users to modify it
to fit their needs
Would then come from the hardware platform.

Zephyr approach
int stm32_i2c_configure_timing(const struct device *dev, uint32_t clock)
{
  const struct i2c_stm32_config *cfg = DEV_CFG(dev);
  struct i2c_stm32_data *data = DEV_DATA(dev);
  I2C_TypeDef *i2c = cfg->i2c;
  uint32_t i2c_hold_time_min, i2c_setup_time_min;
  uint32_t i2c_h_min_time, i2c_l_min_time;
  uint32_t presc = 1U;
  uint32_t timing = 0U;

  /*  Look for an adequate preset timing value */
  for (uint32_t i = 0; i < cfg->n_timings; i++) {
    const struct i2c_config_timing *preset = &cfg->timings[i];
    uint32_t speed = i2c_map_dt_bitrate(preset->i2c_speed);

    if ((I2C_SPEED_GET(speed) == I2C_SPEED_GET(data->dev_config))
       && (preset->periph_clock == clock)) {
      /*  Found a matching periph clock and i2c speed */
      LL_I2C_SetTiming(i2c, preset->timing_setting);
      return 0;
    }
  }

  /* No preset timing was provided, let's dynamically configure */
  switch (I2C_SPEED_GET(data->dev_config)) {
  case I2C_SPEED_STANDARD:
    i2c_h_min_time = 4000U;
    i2c_l_min_time = 4700U;
    i2c_hold_time_min = 500U;
    i2c_setup_time_min = 1250U;
    break;
  case I2C_SPEED_FAST:
    i2c_h_min_time = 600U;
    i2c_l_min_time = 1300U;
    i2c_hold_time_min = 375U;
    i2c_setup_time_min = 500U;
    break;
  default:
    return -EINVAL;
  }

  /* Calculate period until prescaler matches */
  do {
    uint32_t t_presc = clock / presc;
    uint32_t ns_presc = NSEC_PER_SEC / t_presc;
    uint32_t sclh = i2c_h_min_time / ns_presc;
    uint32_t scll = i2c_l_min_time / ns_presc;
    uint32_t sdadel = i2c_hold_time_min / ns_presc;
    uint32_t scldel = i2c_setup_time_min / ns_presc;

    if ((sclh - 1) > 255 ||  (scll - 1) > 255) {
      ++presc;
      continue;
    }

    if (sdadel > 15 || (scldel - 1) > 15) {
      ++presc;
      continue;
    }

    timing = __LL_I2C_CONVERT_TIMINGS(presc - 1,
          scldel - 1, sdadel, sclh - 1, scll - 1);
    break;
  } while (presc < 16);

  if (presc >= 16U) {
    LOG_DBG("I2C:failed to find prescaler value");
    return -EINVAL;
  }

  LL_I2C_SetTiming(i2c, timing);

  return 0;
}
#endif
#define I2C_TIMING 0x00F02B86 // Also try: 0x0020098E, 0x00F02B86, 0x00D00E28
// the 002 version is 100kHz with HSI = 16MHz
// 00D is 1MHz with I2C source as SYSCLK = 80 MHz
// 00F is 400Khz with I2CCLK = 80MHz
// If this doesn't work, try cubeMX generation
void STM32I2CMaster::start_() noexcept
{
	auto i2c_inst = i2c_instance[device_];
	assert(i2c_inst); // if failed, device is invalid

	configure_i2c_pins_();

	STM32ClockControl::i2cEnable(device_);

	// Disable before modifying configuration registers
	// TODO once working: can we remove?
	LL_I2C_Disable(i2c_inst);

	// TODO: can this be constexpr? LL init func doens't take const...
	static LL_I2C_InitTypeDef initializer = {
		.PeripheralMode = LL_I2C_MODE_I2C,
		.Timing = I2C_TIMING,
		.AnalogFilter = LL_I2C_ANALOGFILTER_ENABLE,
		.DigitalFilter = 0x00,
		.OwnAddress1 = 0x00,
		.TypeAcknowledge = LL_I2C_ACK,
		.OwnAddrSize = LL_I2C_OWNADDRESS1_7BIT,
	};

