embvm/stm32l4/src/drivers/stm32_i2c_master.cpp
	configureDMA();

	LL_I2C_EnableDMAReq_RX(i2c_inst);
	LL_I2C_EnableDMAReq_TX(i2c_inst);

	auto r = LL_I2C_Init(i2c_inst, &initializer);
	assert(r == 0);

	enableInterrupts();
}

void STM32I2CMaster::stop_() noexcept
{
	auto i2c_inst = i2c_instance[device_];
	assert(i2c_inst); // if failed, device is invalid

	disableInterrupts();

	LL_I2C_DeInit(i2c_inst);

	LL_I2C_DisableDMAReq_RX(i2c_inst);
	LL_I2C_DisableDMAReq_TX(i2c_inst);

	STM32ClockControl::i2cDisable(device_);
}

void STM32I2CMaster::configureDMA() noexcept
{
	tx_channel_.setConfiguration(LL_DMA_DIRECTION_MEMORY_TO_PERIPH | LL_DMA_PRIORITY_HIGH |
									 LL_DMA_MODE_NORMAL | LL_DMA_PERIPH_NOINCREMENT |
									 LL_DMA_MEMORY_INCREMENT | LL_DMA_PDATAALIGN_BYTE |
									 LL_DMA_MDATAALIGN_BYTE,
								 dma_tx_routing[device_]);
	rx_channel_.setConfiguration(LL_DMA_DIRECTION_PERIPH_TO_MEMORY | LL_DMA_PRIORITY_HIGH |
									 LL_DMA_MODE_NORMAL | LL_DMA_PERIPH_NOINCREMENT |
									 LL_DMA_MEMORY_INCREMENT | LL_DMA_PDATAALIGN_BYTE |
									 LL_DMA_MDATAALIGN_BYTE,
								 dma_rx_routing[device_]);

	// TODO: does this happen here? or only if we need to handle special cases?
	tx_channel_.registerCallback([this](STM32DMA::status status) {
		if(status != STM32DMA::status::ok)
		{
			// TODO: handle error?
			assert(0); // transfer failed
		}
	});
	rx_channel_.registerCallback([this](STM32DMA::status status) {
		if(status != STM32DMA::status::ok)
		{
			// TODO: handle error?
			assert(0); // transfer failed
		}
	});

	tx_channel_.start();
	rx_channel_.start();
}

void STM32I2CMaster::configure_i2c_pins_() noexcept
{
	assert(device_ == STM32I2CMaster::device::i2c2); // Others not currently supported

	// TODO: move out of here and into hardware platform??
	auto pins = i2c_pins[device_];
	STM32GPIOTranslator::configure_alternate_i2c(pins.scl_port, pins.scl_pin, pins.scl_alt_func);
	STM32GPIOTranslator::configure_alternate_i2c(pins.sda_port, pins.sda_pin, pins.sda_alt_func);
}

embvm::i2c::pullups STM32I2CMaster::setPullups_(embvm::i2c::pullups pullups) noexcept
{
	// TODO: right now this is just set internally
	return pullups;
}

embvm::i2c::baud STM32I2CMaster::baudrate_(embvm::i2c::baud baud) noexcept
{
	// TODO:
	return baud;
}

void STM32I2CMaster::enableInterrupts() noexcept
{
	uint8_t error_irq = error_irq_num[device_];
	uint8_t event_irq = event_irq_num[device_];
	auto inst = i2c_instance[device_];
	assert(error_irq && event_irq && inst); // Check that channel is supported

	NVICControl::priority(error_irq, 0); // TODO: how to configure priority for the driver?
	NVICControl::enable(error_irq);
	NVICControl::priority(event_irq, 0); // TODO: how to configure priority for the driver?
	NVICControl::enable(event_irq);

	/* Enable I2C transfer complete/error interrupts:
	 *  - Enable Receive Interrupt
	 *  - Enable Not acknowledge received interrupt
	 *  - Enable Error interrupts
	 *  - Enable Stop interrupt
	 */
	LL_I2C_EnableIT_NACK(inst);
	LL_I2C_EnableIT_ERR(inst); // Enables Arbitration loss, Bus error, overrun/underrun errors
	LL_I2C_EnableIT_STOP(inst);
	LL_I2C_EnableIT_TC(inst); // Enables both transfer complete and transfer complete reload
}

void STM32I2CMaster::disableInterrupts() noexcept
{
	uint8_t error_irq = error_irq_num[device_];
	uint8_t event_irq = event_irq_num[device_];
	auto inst = i2c_instance[device_];
	assert(error_irq && event_irq && inst); // Check that channel is supported

	LL_I2C_DisableIT_NACK(inst);
	LL_I2C_DisableIT_ERR(inst);
	LL_I2C_DisableIT_STOP(inst);
	LL_I2C_DisableIT_TC(inst);
	NVICControl::disable(error_irq);
	NVICControl::disable(event_irq);
}

// Blocking implementation - nonblocking to come
embvm::i2c::status STM32I2CMaster::transfer_(const embvm::i2c::op_t& op,
											 const embvm::i2c::master::cb_t& cb) noexcept
{
	auto status = embvm::i2c::status::ok;
	auto i2c_inst = i2c_instance[device_];
	assert(i2c_inst); // Instance is not valid if failed
	uint32_t generate_mode = LL_I2C_GENERATE_STOP;
	uint32_t end_mode = LL_I2C_MODE_AUTOEND;
	uint32_t transfer_size = 0;

	// Note that the STM32 calls don't shift the address for us, so we need
	// to do this manually.
	uint32_t address = static_cast<uint32_t>(op.address << 1);

	// Reset per-transfer settings
	transfer_completed_ = false;
	i2c_callbacks[device_] = nullptr;

	// TODO: need to check if busy, or else we return (see nRF52 implementation)
	// TODO: should this be a move, not a copy?
	active_op_ = op;

	/** A Note on Large Transfers (> 255 bytes)
	 *
	 * For large transfers, we need to use the "reload" capability to ensure that the Transfer
	 * Complete Reload (TCR) flag/interrupt will fire. After the programmed number of bytes has been
	 * transferred, you'll get an interrupt. The additional number of bytes to be transferred is
	 * programmed, the TCR bit is set once more, and then the data transfer will resume.
	 *
	 * Note that when RELOAD is set, AUTOEND has no effect. We need to STOP the transfer manually.
	 *
	 * To handle this logic, use the check_and_adjust_transfer_size() function, which will set
	 * variables that are accessible in an interrupt context and can be used for handling these
	 * large transfers without necessary intervention on your part.
	 *
	 * Also note that since the DMA block can handle sizes > 255, we will pass the full
	 * buffer size to the enableDMATx/Rx functions.
	 */
	switch(op.op)
	{
		case embvm::i2c::operation::continueWriteStop:
		case embvm::i2c::operation::write: {
			// TODO: is this case really separated, because continue write I don't want to generate
			// a start? Or is it fine? I think I might need to separate them for a different
			// behavior - e.g. GENERATE_NOSTARTSTOP + AutoEnd?
			std::tie(transfer_size, end_mode) =
				check_and_adjust_transfer_size(device_, op.tx_size, LL_I2C_MODE_AUTOEND);
			generate_mode = LL_I2C_GENERATE_START_WRITE;
			enableDMATx(tx_channel_, i2c_inst, op.tx_buffer, op.tx_size);
			break;
		}
		case embvm::i2c::operation::writeNoStop:
		case embvm::i2c::operation::continueWriteNoStop: {
			std::tie(transfer_size, end_mode) =
				check_and_adjust_transfer_size(device_, op.tx_size, LL_I2C_MODE_SOFTEND);
			// TODO: for continue, does this need to be separated as a case?
			generate_mode = LL_I2C_GENERATE_START_WRITE;
			enableDMATx(tx_channel_, i2c_inst, op.tx_buffer, op.tx_size);
			break;
		}
		case embvm::i2c::operation::read: {
			std::tie(transfer_size, end_mode) =
				check_and_adjust_transfer_size(device_, op.tx_size, LL_I2C_MODE_AUTOEND);
			generate_mode = LL_I2C_GENERATE_START_READ;
			enableDMARx(rx_channel_, i2c_inst, op.rx_buffer, op.rx_size);
			break;
		}
		case embvm::i2c::operation::writeRead: {
			std::tie(transfer_size, end_mode) = check_and_adjust_transfer_size(device_, op.tx_size, LL_I2C_MODE_SOFTEND);
			generate_mode = LL_I2C_GENERATE_START_WRITE;

			// Override auto-end setting to specify that we need to kick off a read
			// if we are in RELOAD mode.
			end_of_transfer_action[device_] = end_transfer_option::START_RX;

			// TODO: does this need adjusted in full async mode?
			// Register intermediate callback that enables receive
			i2c_callbacks[device_] = [this](auto status)
			{
				(void) status;
				// Disable TX DMA, put us in RX mode.
				tx_channel_.disable();
				auto [transfer_size, end_mode] = check_and_adjust_transfer_size(device_, active_op_.rx_size, LL_I2C_MODE_AUTOEND);
				auto inst = i2c_instance[device_];
				enableDMARx(rx_channel_, inst, active_op_.rx_buffer, active_op_.rx_size);
				LL_I2C_HandleTransfer(inst, active_op_.address << 1, LL_I2C_ADDRSLAVE_7BIT, transfer_size, end_mode, LL_I2C_GENERATE_START_READ);
				i2c_callbacks[device_] = i2c_callbacks[device_] = [this](auto s)
				{
					assert(s == embvm::i2c::status::ok);
					transfer_completed_ = true;
					tx_channel_.disable();
					rx_channel_.disable();
				};
			};
			enableDMATx(tx_channel_, i2c_inst, op.tx_buffer, op.tx_size);
			break;
		}
		case embvm::i2c::operation::ping: {
			// TODO: zero-bytes correct here?
			// TODO: do we need to enable LL_I2C_EnableIT_ADDR, at least for ping?? Need to disable
			// somewhere too..
			// TODO: we need to check for ping errors properly in interrupt handler
			assert(0);
			transfer_size = 0;
			end_mode = LL_I2C_MODE_AUTOEND;
			generate_mode = LL_I2C_GENERATE_START_WRITE;
			break;
		}
		case embvm::i2c::operation::stop: {
			// TODO?
			// LL_I2C_GenerateStopCondition(i2c_inst);
			// Instance, slave address, slave address size, transfer size, end mode, request);
			assert(0);
			transfer_size = 0;
			end_mode = LL_I2C_MODE_AUTOEND;
			generate_mode = LL_I2C_GENERATE_STOP;
			break;
		}
		case embvm::i2c::operation::restart: {
			// TODO: does this work?
			assert(0);
			transfer_size = 0;
			end_mode = LL_I2C_MODE_SOFTEND;
			generate_mode = LL_I2C_GENERATE_RESTART_7BIT_WRITE;
			break;
		}
	}

	// If we didn't set a custom handler above, we need to set a default handler here.
	// TODO: make this properly work in async mode
	// TODO: make this a function so we can eliminate duplication in writeRead case above.
	if(!i2c_callbacks[device_])
	{
		i2c_callbacks[device_] = [this](auto s)
		{
			assert(s == embvm::i2c::status::ok);
			transfer_completed_ = true;
			tx_channel_.disable();
			rx_channel_.disable();
		};
	}

	// Start the transfer
	LL_I2C_HandleTransfer(i2c_inst, address, LL_I2C_ADDRSLAVE_7BIT, transfer_size, end_mode,
						  generate_mode);

	// TODO: this needs to return enqueued and handle things asynchronously... for now we block.
	while(!transfer_completed_)
		;

	// TODO: make sure error is properly reported

	return status;
}

void STM32I2CMaster::configure_(embvm::i2c::pullups pullup)
{
	assert(0); // TODO:
}
